node {
  name: "global_step"
  op: "Variable"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_step/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "global_step/Assign"
  op: "Assign"
  input: "global_step"
  input: "global_step/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_step/read"
  op: "Identity"
  input: "global_step"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "input_producer/Const"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 804
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 804
          }
        }
        string_val: "NetworkReadyGameStateRepresentations/gameStates_1.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_2.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_3.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_4.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_5.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_6.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_7.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_8.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_9.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_11.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_12.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_13.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_14.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_15.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_16.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_17.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_18.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_19.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_21.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_22.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_23.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_24.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_25.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_26.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_27.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_28.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_29.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_31.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_32.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_33.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_34.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_35.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_36.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_37.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_38.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_39.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_41.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_42.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_43.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_44.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_45.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_46.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_47.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_48.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_49.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_51.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_52.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_53.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_54.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_55.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_56.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_57.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_58.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_59.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_61.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_62.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_63.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_64.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_65.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_66.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_67.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_68.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_69.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_71.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_72.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_73.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_74.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_75.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_76.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_77.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_78.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_79.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_81.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_82.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_83.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_84.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_85.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_86.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_87.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_88.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_89.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_91.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_92.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_93.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_94.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_95.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_96.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_97.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_98.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_99.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_101.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_102.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_103.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_104.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_105.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_106.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_107.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_108.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_109.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_111.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_112.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_113.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_114.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_115.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_116.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_117.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_118.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_119.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_121.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_122.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_123.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_124.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_125.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_126.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_127.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_128.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_129.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_131.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_132.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_133.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_134.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_135.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_136.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_137.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_138.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_139.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_141.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_142.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_143.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_144.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_145.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_146.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_147.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_148.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_149.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_151.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_152.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_153.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_154.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_155.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_156.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_157.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_158.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_159.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_161.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_162.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_163.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_164.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_165.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_166.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_167.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_168.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_169.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_171.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_172.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_173.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_174.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_175.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_176.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_177.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_178.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_179.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_181.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_182.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_183.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_184.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_185.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_186.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_187.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_188.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_189.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_191.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_192.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_193.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_194.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_195.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_196.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_197.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_198.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_199.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_201.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_202.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_203.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_204.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_205.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_206.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_207.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_208.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_209.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_211.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_212.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_213.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_214.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_215.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_216.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_217.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_218.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_219.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_221.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_222.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_223.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_224.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_225.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_226.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_227.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_228.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_229.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_231.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_232.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_233.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_234.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_235.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_236.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_237.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_238.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_239.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_241.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_242.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_243.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_244.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_245.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_246.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_247.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_248.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_249.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_251.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_252.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_253.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_254.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_255.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_256.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_257.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_258.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_259.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_261.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_262.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_263.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_264.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_265.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_266.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_267.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_268.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_269.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_271.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_272.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_273.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_274.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_275.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_276.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_277.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_278.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_279.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_281.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_282.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_283.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_284.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_285.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_286.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_287.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_288.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_289.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_291.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_292.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_293.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_294.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_295.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_296.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_297.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_298.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_299.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_301.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_302.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_303.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_304.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_305.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_306.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_307.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_308.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_309.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_311.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_312.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_313.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_314.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_315.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_316.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_317.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_318.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_319.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_321.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_322.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_323.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_324.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_325.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_326.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_327.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_328.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_329.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_331.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_332.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_333.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_334.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_335.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_336.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_337.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_338.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_339.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_341.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_342.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_343.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_344.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_345.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_346.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_347.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_348.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_349.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_351.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_352.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_353.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_354.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_355.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_356.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_357.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_358.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_359.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_361.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_362.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_363.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_364.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_365.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_366.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_367.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_368.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_369.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_371.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_372.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_373.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_374.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_375.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_376.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_377.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_378.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_379.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_381.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_382.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_383.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_384.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_385.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_386.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_387.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_388.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_389.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_391.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_392.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_393.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_394.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_395.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_396.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_397.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_398.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_399.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_401.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_402.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_403.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_404.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_405.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_406.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_407.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_408.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_409.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_411.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_412.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_413.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_414.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_415.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_416.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_417.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_418.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_419.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_421.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_422.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_423.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_424.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_425.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_426.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_427.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_428.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_429.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_431.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_432.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_433.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_434.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_435.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_436.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_437.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_438.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_439.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_441.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_442.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_443.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_444.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_445.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_446.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_447.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_448.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_449.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_451.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_452.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_453.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_454.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_455.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_456.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_457.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_458.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_459.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_461.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_462.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_463.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_464.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_465.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_466.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_467.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_468.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_469.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_471.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_472.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_473.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_474.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_475.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_476.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_477.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_478.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_479.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_481.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_482.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_483.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_484.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_485.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_486.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_487.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_488.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_489.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_491.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_492.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_493.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_494.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_495.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_496.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_497.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_498.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_499.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_501.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_502.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_503.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_504.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_505.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_506.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_507.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_508.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_509.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_511.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_512.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_513.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_514.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_515.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_516.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_517.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_518.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_519.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_521.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_522.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_523.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_524.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_525.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_526.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_527.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_528.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_529.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_531.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_532.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_533.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_534.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_535.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_536.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_537.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_538.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_539.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_541.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_542.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_543.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_544.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_545.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_546.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_547.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_548.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_549.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_551.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_552.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_553.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_554.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_555.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_556.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_557.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_558.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_559.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_561.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_562.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_563.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_564.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_565.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_566.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_567.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_568.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_569.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_571.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_572.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_573.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_574.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_575.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_576.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_577.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_578.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_579.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_581.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_582.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_583.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_584.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_585.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_586.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_587.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_588.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_589.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_591.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_592.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_593.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_594.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_595.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_596.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_597.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_598.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_599.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_601.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_602.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_603.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_604.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_605.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_606.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_607.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_608.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_609.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_611.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_612.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_613.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_614.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_615.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_616.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_617.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_618.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_619.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_621.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_622.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_623.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_624.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_625.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_626.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_627.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_628.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_629.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_631.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_632.tfrecords"
        string_val: "NetworkReadyGameStateRepresentations/gameStates_633.tfrecords"
